feat: migrate diagrams to Mermaid
